Repository: Pavel-Mishalov/Plugin_market-exporter
Catalog: languages/market-exporter-*.po
Languages: ru_ru

source: Global settings
ru_ru: Основные настройки

source: Website Name
ru_ru: Название сайта

source: Not longer than 20 characters. Has to be the name of the shop, that is configured in Yandex Market.
ru_ru: Не более 20 символов. Должно совпадать с названием магазина, который настроен в Яндекс Маркет.

source: Company Name
ru_ru: Название организации

source: Full company name. Not published in Yandex Market.
ru_ru: Полное наименование организации. Не публикуется на Яндекс Маркет.

source: Add date to YML file name
ru_ru: Добавить дату в имя файла YML

source: If enabled YML file will have current date at the end: ym-export-yyyy-mm-dd.yml.
ru_ru: Если активна, то к имена файла YML будет добавляться текущая дата: yml-export-yyyy-mm-dd.yml.

source: Images per product
ru_ru: Изображений на товарное предложение

source: Max number of images to export for product. Max 10 images.
ru_ru: Максимальное количество изображений для товарного предложения. Макс 10 изображений.

source: Disabled
ru_ru: Отключено

source: Vendor property
ru_ru: Элемент vendor

source: Custom property used to specify vendor.
ru_ru: Атрибут, который отвечает за значение элемента vendor на Яндекс Маркет.

source: Market category property
ru_ru: Элемент market_catergory

source: Category of product on Yandex Market. Can be set to a value from <a href="%s" target="_blank">this list</a> only.
ru_ru: Категория товаров на Яндекс Маркет. Может принимать значение из <a href="%s" target="_blank">этого списка</a>.

source: Enable sales_notes
ru_ru: Использовать элемент sales_notes

source: If enabled will use product field "short description" as value for property "sales_notes". Not longer than 50 characters.
ru_ru: Если активировано, то поле "короткое описание" товара будет отвечать за элемент "sales_notes". Не более 50 символов.

source: Export products with backorders
ru_ru: Экспорт товаров со статусом предзаказ

source: If enabled products that are available for backorder will be exported to YML.
ru_ru: Если активна, то товары, доступные для предзаказа, будут экспортированы в YML.

source: Include selected categories
ru_ru: Включать следующие категории

source: Only selected categories will be included in the export file. Hold down the control (ctrl) button on Windows or command (cmd) on Mac to select multiple options. If nothing is selected - all the categories will be exported.
ru_ru: Только выбранные категории товаров будут экспортированы в файл. Чтобы выбрать несколько категорий, зажмите клавишу ctrl (на Windows) или cmd (на Mac). Если не выбрана ни одна категория, то экспортируются все товары.

source: Settings that are used in the export process.
ru_ru: Настройки экспорта.

source: Settings
ru_ru: Настройки

source: Error creating directory.
ru_ru: Ошибка при создании директории.

source: Error uploading file.
ru_ru: Ошибка при сохранении файла.

source: Version:
ru_ru: Версия:

source: Generate file
ru_ru: Генерировать файл

source: Files
ru_ru: Файлы

source: News
ru_ru: Новости

source: You don't have the permission to do this.
ru_ru: У Вас недостаточно прав.

source: Currently only the following currency is supported: Russian Ruble (RUB), Ukrainian Hryvnia (UAH), US Dollar (USD) and Euro (EUR). Please <a href="%s">update currency</a>.
ru_ru: Поддерживаются следующие валюты: Российский рубль (RUB), Украинская гривна (UAH), Доллар США (USD) и Евро (EUR). Пожалуйста, <a href="%s">обновите валюту</a>.

source: No shipping methods are available. Please <a href="%s">update or add at least one</a>.
ru_ru: Не указаны способы доставки. Пожалуйста, <a href="%s">обновите данные</a>.

source: Unable to find any products. Are you sure <a href="%s">some exist</a>?
ru_ru: Не найдено ни одного товара. Вы точно <a href="%s">добавили</a> товар?

source: File exported successfully: <a href="%s">%s</a>.
ru_ru: Файл создан: <a href="%s">%s</a>.

source: This plugin is used to generate a valid YML file for exporting your products in WooCommerce to Yandex Market.
ru_ru: Данный плагин используется для генерации валидного YML файла для экспортированная товаров из WooCommerce в Яндекс Маркет.

source: Please be patient while the YML file is generated. This can take a while if your server is slow (inexpensive hosting) or if you have many products in WooCommerce. Do not navigate away from this page until this script is done or the YML file will not be created. You will be notified via this page when the process is completed.
ru_ru: Пожалуйста, будьте терпеливы в то время как файл YML генерируется. Это может занять некоторое время если ваш сервер медленно работает (например, если используется недорогой хостинг) или если у Вас много товарных предложений в WooCommerce. Не уходите с этой страницы, пока этот процесс не будет завершен, или файл YML не будет создан. Вы будете уведомлены при завершении.

source: To begin, just press the button below.
ru_ru: Чтобы начать, нажмите на кнопку ниже.

source: Generate YML file
ru_ru: Генерировать YML файл

source: You must enable Javascript in order to proceed!
ru_ru: Для продолжения необходимо активировать Javascript в Вашем браузере!

source: Generated YML files
ru_ru: Доступные YML файлы

source: File name
ru_ru: Имя файла

source: Action
ru_ru: Действие

source: Open file
ru_ru: Открыть файл

source: Delete selected files
ru_ru: Удалить выбранные файлы

source: Settings Saved
ru_ru: Настройки сохранены

source: The Market Exporter plugin requires <a href="https://wordpress.org/plugins/woocommerce/">WooCommerce</a> to be installed and activated. Please check your configuration.
ru_ru: Плагину Market Exporter необходим активированный <a href="https://wordpress.org/plugins/woocommerce/">WooCommerce</a>. Пожалуйста, установите или активируйте WooCommerce.

source: Market Exporter provides a way to export products from WooCommerce installations into a YML file for use in Yandex Market.
ru_ru: Плагин Market Exporter позволяет экспортировать товарные предложения из WooCommerce в файл YML для Яндекс Маркет.

source: Anton Vanyukov
ru_ru: Антон Ванюков
